module.ecs_service.data.aws_iam_policy_document.task_assume_role: Reading...
module.api_gateway.aws_apigatewayv2_api.api: Refreshing state... [id=fin2rd81o1]
module.ecs_cluster.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:cluster/cerepx-dev-cluster]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-029a6cd1da94ed29e]
module.rds.aws_kms_key.rds_performance_insights: Refreshing state... [id=c7a90af2-b80a-47f5-817d-76ef08929a64]
module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Reading...
module.ecs_service.aws_cloudwatch_log_group.ecs_logs: Refreshing state... [id=/ecs/hello-birthday-api-service]
module.vpc.aws_kms_key.vpc_flow_logs: Refreshing state... [id=347137e7-8489-4dd5-8ff0-561bac764438]
module.vpc.aws_iam_role.flow_logs_role: Refreshing state... [id=vpc-flow-logs-role]
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=hello-birthday-api-service-exec]
module.ecs_service.aws_iam_role.task_role: Refreshing state... [id=hello-birthday-api-service-task]
module.ecs_service.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=hello-birthday-api-service-exec-20250428162643346700000002]
module.vpc.aws_iam_role_policy.flow_logs_policy: Refreshing state... [id=vpc-flow-logs-role:vpc-flow-logs-policy]
module.api_gateway.aws_apigatewayv2_stage.default_stage: Refreshing state... [id=$default]
module.vpc.aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flowlogs/hello-birthday-dev]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-01c87601e22172550]
module.vpc.aws_security_group.ecs: Refreshing state... [id=sg-0ae81af3f721e51a4]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b4f96a4a08eb4a5b]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0116a9ef8764923a8]
module.vpc.aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0f0309c1f8f7d983e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ddb2b3fdf159574c]
module.vpc.aws_security_group.alb: Refreshing state... [id=sg-076af04a71628d30b]
module.alb.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6]
module.vpc.aws_security_group.rds: Refreshing state... [id=sg-0622864b918d283ed]
module.vpc.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-021526ee9aacb5835]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ca998b2f809f036c]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-07832cfb87db1c4c3]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0b360bbebcaa480e5]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-061f4a5976790ac17]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08047ccfb754ab73d]
module.api_gateway.aws_apigatewayv2_vpc_link.api_vpc_link: Refreshing state... [id=ef4cpb]
module.vpc.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0a52f66d478624684]
module.vpc.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-00fcf997fa737e3ff]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f88590ccfac5c504]
module.vpc.aws_vpc_endpoint.cloudwatch_logs: Refreshing state... [id=vpce-0c74164063fcc63f1]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=hello-birthday-dev-subnet-group]
module.vpc.aws_route.default_internet_access: Refreshing state... [id=r-rtb-0b360bbebcaa480e51080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-000b959cb9c8c17b6]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bc26398f249d5dad]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/985cc60b534ada89]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/985cc60b534ada89/9e3573c22ce1f6af]
module.rds.aws_db_instance.this: Refreshing state... [id=db-MNYKAUQQ3O3OCCMOP5A35SVKSM]
module.ecs_service.aws_ecs_task_definition.this: Refreshing state... [id=hello-birthday-api-service]
module.ecs_service.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service]
module.api_gateway.aws_apigatewayv2_integration.alb_integration: Refreshing state... [id=ycj81b2]
module.api_gateway.aws_apigatewayv2_route.default_route: Refreshing state... [id=77el2at]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alb.aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                                                                  = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/985cc60b534ada89/9e3573c22ce1f6af"
        tags                                                                = {}
        # (17 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.alb.aws_lb_target_group.this must be replaced
-/+ resource "aws_lb_target_group" "this" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/hello-birthday-api-tg/3407dc930bad48b6" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/985cc60b534ada89",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "hello-birthday-api-tg"
      + name_prefix                        = (known after apply)
      ~ port                               = 5050 -> 5000 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}

        # (1 unchanged block hidden)
    }

  # module.ecs_service.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service"
        name                               = "hello-birthday-api-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service:12" -> (known after apply)
        # (16 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "hello-birthday-api" -> null
          - container_port   = 5050 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "hello-birthday-api"
          + container_port   = 5000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - essential        = true
                  - mountPoints      = []
                    name             = "hello-birthday-api"
                  ~ portMappings     = [
                      ~ {
                          ~ containerPort = 5050 -> 5000
                          ~ hostPort      = 5050 -> 5000
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "hello-birthday-api-service" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_security_group.ecs will be updated in-place
  ~ resource "aws_security_group" "ecs" {
        id                     = "sg-0ae81af3f721e51a4"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.10.0.0/16",
                ]
              - description      = "HTTP from ALB"
              - from_port        = 5050
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5050
            },
          - {
              - cidr_blocks      = []
              - from_port        = 5050
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-076af04a71628d30b",
                ]
              - self             = false
              - to_port          = 5050
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                ]
              + description      = "HTTP from ALB"
              + from_port        = 5000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5000
            },
        ]
        name                   = "hello-birthday-dev-ecs-sg"
        tags                   = {
            "Environment" = "dev"
            "Name"        = "hello-birthday-dev-ecs-sg"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

<!-- Sticky Pull Request Commentterraform-plan -->